# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3CA, [1024]],
  #  [-1, 3, CBAM, [1024, 3]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [
    [-1, 1, Conv, [512, 1, 1]],                          # 10
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],          # 11
    [[-1, 6], 1, Concat, [1]],                           # 12  (P5->P4 merge)
    [-1, 3, C3CA, [512, False]],                         # 13  (P4 td)

    [-1, 1, Conv, [256, 1, 1]],                          # 14
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],          # 15
    [[-1, 4], 1, Concat, [1]],                           # 16  (P4->P3 merge)
    [-1, 3, C3CA, [256, False]],                         # 17  (P3 td)  <-- ECA after this

    [-1, 1, Conv, [256, 3, 2]],                          # 18
    [[-1, 14], 1, Concat, [1]],                          # 19
    [-1, 3, C3CA, [512, False]],                         # 20  (P4 bu)  <-- ECA after this

    [-1, 1, Conv, [512, 3, 2]],                          # 21
    [[-1, 10], 1, Concat, [1]],                          # 22
    [-1, 3, C3CA, [1024, False]],                        # 23  (P5 bu)  <-- ECA after this

    # --- ECA attention right after scale features ---
    [17, 1, ECA, [256, 5]],    # P3 -> 256 ch
    [20, 1, ECA, [512, 5]],    # P4 -> 512 ch
    [23, 1, ECA, [1024, 5]],   # P5 -> 1024 ch

    # Detect now uses the ECA-processed features
    [[24, 25, 26], 1, Detect, [nc, anchors]],
  ]
  
