# YOLOv5 🚀 Architecture Modified for Small Object Detection with Coordinate Attention (CA)

# Parameters
nc: 1   # <--- REMINDER: Set this to your class count (e.g., 1)
depth_multiple: 0.33  # model depth multiple (s-size)
width_multiple: 0.50  # model width multiple (s-size)
anchors:
  - [3,5, 5,8, 8,11]       # P2/4 anchors (VERY SMALL)
  - [10,13, 16,30, 33,23]   # P3/8 anchors (small)
  - [30,61, 62,45, 59,119]  # P4/16 anchors (medium)
  - [116,90, 156,198, 373,326] # P5/32 anchors (large)

# YOLOv5 backbone
backbone:
  # [from, repeats, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],    # 1-P2/4 (Source for the new P2 head)
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],    # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],    # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],   # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],      # 9
  ]

# YOLOv5 head (Neck & Detection)
head:
  # Top-down path (FPN for semantic features)
  [[-1, 1, Conv, [512, 1, 1]], 
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],      # cat backbone P4
   [-1, 3, C3CA, [512, False]],    # 13: P4 Top-Down Attention

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],      # cat backbone P3
   [-1, 3, C3CA, [256, False]],    # 17: P3 Top-Down Attention

   # =====================================================================
   # P2 ADDITION: New branch for V-E-R-Y Small Objects (P2/4)
   [-1, 1, Conv, [128, 1, 1]],             
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], 
   [[-1, 2], 1, Concat, [1]],              # <--- CAT backbone P2 (Index 2)
   [-1, 3, C3CA, [128, False]],            # 21: P2 Head Attention
   # =====================================================================

   # Bottom-up path (PANet for positional features)
   [-1, 1, Conv, [256, 3, 2]],    # 22: Downsample P2->P3
   [[-1, 17], 1, Concat, [1]],    # cat head P3
   [-1, 3, C3CA, [256, False]],    # 24: P3 Bottom-Up Attention

   [-1, 1, Conv, [512, 3, 2]],    # 25: Downsample P3->P4
   [[-1, 13], 1, Concat, [1]],    # cat head P4
   [-1, 3, C3CA, [512, False]],    # 27: P4 Bottom-Up Attention

   [-1, 1, Conv, [1024, 3, 2]],   # 28: Downsample P4->P5
   [[-1, 9], 1, Concat, [1]],     # cat head P5
   [-1, 3, C3, [1024, False]],    # 30: P5 Bottom-Up (CA not strictly needed here)

   # Final Detection Layer - NOW HAS FOUR OUTPUTS
   [[21, 24, 27, 30], 1, Detect, [nc, anchors]], # Detect(P2, P3, P4, P5)
  ]