# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1
depth_multiple: 1.0 # model depth multiple
width_multiple: 1.0 # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]       # P3/8
  - [30,61, 62,45, 59,119]      # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# Backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],     # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],       # 1-P2/4
   [-1, 3, C3,   [128]],             # 2
   [-1, 1, CoordinateAttention, [128]],            # 3  (Coordinate Attention)
   [-1, 1, Conv, [256, 3, 2]],       # 4-P3/8
   [-1, 6, C3,   [256]],             # 5
   [-1, 1, CBAMHybridCA, [256]],      # 6  (CBAM channel + CA spatial)
   [-1, 1, Conv, [512, 3, 2]],       # 7-P4/16
   [-1, 9, C3,   [512]],             # 8
   [-1, 1, Conv, [1024, 3, 2]],      # 9-P5/32
   [-1, 3, C3,   [1024]],            # 10
   [-1, 1, CBAM, [1024]],            # 11 (full CBAM)
   [-1, 1, SPPF, [1024, 5]],         # 12
  ]

# Head
head:
  [
    [-1, 1, Conv, [512, 1, 1]],                 # 13
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 14
    [[-1, 8], 1, Concat, [1]],                  # 15  concat with backbone P4 (layer 8)
    [-1, 3, C3, [512, False]],                  # 16
    [-1, 1, CoordinateAttention, [512]],                      # 17  (light CA on P4 head)

    [-1, 1, Conv, [256, 1, 1]],                 # 18
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 19
    [[-1, 5], 1, Concat, [1]],                  # 20  concat with backbone P3 (layer 5)
    [-1, 3, C3, [256, False]],                  # 21  (P3/8 small)
    [-1, 1, CBAMHybridCA, [256]],                # 22  (hybrid on P3 head)

    [-1, 1, Conv, [256, 3, 2]],                 # 23  down to P4/16
    [[-1, 16], 1, Concat, [1]],                 # 24  concat with P4 head (layer 16)
    [-1, 3, C3, [512, False]],                  # 25  (P4/16 medium)

    [-1, 1, Conv, [512, 3, 2]],                 # 26  down to P5/32
    [[-1, 12], 1, Concat, [1]],                 # 27  concat with SPPF (layer 12)
    [-1, 3, C3, [1024, False]],                 # 28  (P5/32 large)

    [[21, 25, 28], 1, Detect, [nc, anchors]],   # 29  Detect(P3, P4, P5)
  ]
